---
kind: method
id: M:Autodesk.Revit.DB.View.GetBackground
zh: 视图
source: html/0f62287e-e8b8-0f6a-ab07-b246b0f42c7f.htm
---
# Autodesk.Revit.DB.View.GetBackground Method

**中文**: 视图

Returns the current background set for the view.

## Syntax (C#)
```csharp
public ViewDisplayBackground GetBackground()
```

## Returns
Current background.